In [2]:
import pandas as pd

In [4]:
one = pd.read_excel('one.xlsx')

In [5]:
one

   aa  23          98
0  bb  45   56.000000
1  cc  67   12.000000
2  dd  89  -30.666667
3  ee  12  -73.666667
4  rr  99 -116.666667
5  uu  15 -159.666667
6  ii  27 -202.666667
7  oo  45 -245.666667

In [6]:
one.columns

Index(['aa', 23, 98], dtype='object')

In [9]:
one[98].mean()

-95.12500000000017

In [10]:

one.describe()

              23          98
count   8.000000    8.000000
mean   49.875000  -95.125000
std    32.642818  105.415871
min    12.000000 -245.666667
25%    24.000000 -170.416667
50%    45.000000  -95.166667
75%    72.500000  -20.000000
max    99.000000   56.000000

In [11]:

#    numpy

In [12]:
import sqlite3

In [13]:
conn = sqlite3.connect('sports.db')

In [14]:
q = "SELECT * FROM players"

In [15]:
two = pd.read_sql_query(q, conn)

In [16]:
two

   id     name       sport       earn   country
0  12  federer      tennis  4050600.0     swiss
1  14    senna     foruma1   346780.0    brazil
2  22      RON    football   680234.0  portugal
3  16   lebron  basketball   408920.0        US
4  20   smriti     cricket    12054.0     india
5  18    saina   badminton    28230.0     india

In [17]:
two.to_excel('sql.xlsx', index=False)

In [19]:

three = pd.read_csv('sample.csv')

In [20]:
three

    item   brand  cost
0  item1  brand1    40
1  item2  brand2    56
2  item3  brand3    78
3  item4  brand4   280
4  item5  brand5     5

In [21]:
type(one)

pandas.core.frame.DataFrame

In [23]:
three.columns[2]

'cost'

In [24]:
three.cost.min()

5

In [25]:
three['cost'].min()

5

In [26]:
three.shape

(5, 3)

In [27]:
three.head(2)

    item   brand  cost
0  item1  brand1    40
1  item2  brand2    56

In [28]:
two

   id     name       sport       earn   country
0  12  federer      tennis  4050600.0     swiss
1  14    senna     foruma1   346780.0    brazil
2  22      RON    football   680234.0  portugal
3  16   lebron  basketball   408920.0        US
4  20   smriti     cricket    12054.0     india
5  18    saina   badminton    28230.0     india

In [29]:
two.country.unique()

array(['swiss', 'brazil', 'portugal', 'US', 'india'], dtype=object)

In [30]:
dicta = {'company':['amazon', 'apple', 'google', 'facebook','microsoft'], 'CEO':['Jeff', 'Tim', 'Sundar', 'Mark', 'Satya'], 'founded': [1994, 1976, 1997, 2004, 1975]}

In [31]:
dicta

{'company': ['amazon', 'apple', 'google', 'facebook', 'microsoft'],
 'CEO': ['Jeff', 'Tim', 'Sundar', 'Mark', 'Satya'],
 'founded': [1994, 1976, 1997, 2004, 1975]}

In [32]:
four = pd.DataFrame(dicta)

In [33]:
four

     company     CEO  founded
0     amazon    Jeff     1994
1      apple     Tim     1976
2     google  Sundar     1997
3   facebook    Mark     2004
4  microsoft   Satya     1975

In [34]:
four.index

RangeIndex(start=0, stop=5, step=1)

In [35]:
four.index = ['alexa', 'siri', 'assitant', 'jarvis', 'cortana']

In [36]:
four

            company     CEO  founded
alexa        amazon    Jeff     1994
siri          apple     Tim     1976
assitant     google  Sundar     1997
jarvis     facebook    Mark     2004
cortana   microsoft   Satya     1975

In [37]:
four['company']

alexa          amazon
siri            apple
assitant       google
jarvis       facebook
cortana     microsoft
Name: company, dtype: object

In [38]:
four[['company']]

            company
alexa        amazon
siri          apple
assitant     google
jarvis     facebook
cortana   microsoft

In [39]:
four[['company', 'founded']]

            company  founded
alexa        amazon     1994
siri          apple     1976
assitant     google     1997
jarvis     facebook     2004
cortana   microsoft     1975

In [40]:
four[0:3]

         company     CEO  founded
alexa     amazon    Jeff     1994
siri       apple     Tim     1976
assitant  google  Sundar     1997

In [41]:
four[-3:-1]

           company     CEO  founded
assitant    google  Sundar     1997
jarvis    facebook    Mark     2004

In [42]:
four[four['founded']<1995]

           company    CEO  founded
alexa       amazon   Jeff     1994
siri         apple    Tim     1976
cortana  microsoft  Satya     1975

In [43]:
two.set_index('sport')

            id     name       earn   country
sport
tennis      12  federer  4050600.0     swiss
foruma1     14    senna   346780.0    brazil
football    22      RON   680234.0  portugal
basketball  16   lebron   408920.0        US
cricket     20   smriti    12054.0     india
badminton   18    saina    28230.0     india

In [44]:
two

   id     name       sport       earn   country
0  12  federer      tennis  4050600.0     swiss
1  14    senna     foruma1   346780.0    brazil
2  22      RON    football   680234.0  portugal
3  16   lebron  basketball   408920.0        US
4  20   smriti     cricket    12054.0     india
5  18    saina   badminton    28230.0     india

In [45]:
two.set_index('sport', inplace=True)

In [46]:
two

            id     name       earn   country
sport
tennis      12  federer  4050600.0     swiss
foruma1     14    senna   346780.0    brazil
football    22      RON   680234.0  portugal
basketball  16   lebron   408920.0        US
cricket     20   smriti    12054.0     india
badminton   18    saina    28230.0     india

In [47]:
two.reset_index(inplace=True)

In [48]:
two

        sport  id     name       earn   country
0      tennis  12  federer  4050600.0     swiss
1     foruma1  14    senna   346780.0    brazil
2    football  22      RON   680234.0  portugal
3  basketball  16   lebron   408920.0        US
4     cricket  20   smriti    12054.0     india
5   badminton  18    saina    28230.0     india

In [49]:
four

            company     CEO  founded
alexa        amazon    Jeff     1994
siri          apple     Tim     1976
assitant     google  Sundar     1997
jarvis     facebook    Mark     2004
cortana   microsoft   Satya     1975

In [50]:
three

    item   brand  cost
0  item1  brand1    40
1  item2  brand2    56
2  item3  brand3    78
3  item4  brand4   280
4  item5  brand5     5

In [51]:
three.sort_values('cost', ascending=True)

    item   brand  cost
4  item5  brand5     5
0  item1  brand1    40
1  item2  brand2    56
2  item3  brand3    78
3  item4  brand4   280

In [52]:
three.rename(columns={'item':'snack'}, inplace=True)

In [53]:
three

   snack   brand  cost
0  item1  brand1    40
1  item2  brand2    56
2  item3  brand3    78
3  item4  brand4   280
4  item5  brand5     5

In [54]:
three['total cost'] = three.eval('cost+(cost*(0.05))')

In [55]:
three

   snack   brand  cost  total cost
0  item1  brand1    40       42.00
1  item2  brand2    56       58.80
2  item3  brand3    78       81.90
3  item4  brand4   280      294.00
4  item5  brand5     5        5.25

In [56]:
three['total cost']

0     42.00
1     58.80
2     81.90
3    294.00
4      5.25
Name: total cost, dtype: float64

In [57]:
three['total cost'].max()

294.0

In [59]:
five = pd.read_csv('food.csv')

In [60]:
five

   Unnamed: 0         item   cost
0           1        salad   40.0
1           2      biryani  120.0
2           3       burger   38.0
3           4        bajji   20.0
4           5  corn flakes    NaN
5           6      paratha   40.0

In [61]:
five.isnull()

   Unnamed: 0   item   cost
0       False  False  False
1       False  False  False
2       False  False  False
3       False  False  False
4       False  False   True
5       False  False  False

In [62]:
five.isnull().sum()

Unnamed: 0    0
item          0
cost          1
dtype: int64

In [63]:
four

            company     CEO  founded
alexa        amazon    Jeff     1994
siri          apple     Tim     1976
assitant     google  Sundar     1997
jarvis     facebook    Mark     2004
cortana   microsoft   Satya     1975

In [64]:
three

   snack   brand  cost  total cost
0  item1  brand1    40       42.00
1  item2  brand2    56       58.80
2  item3  brand3    78       81.90
3  item4  brand4   280      294.00
4  item5  brand5     5        5.25

In [65]:
five

   Unnamed: 0         item   cost
0           1        salad   40.0
1           2      biryani  120.0
2           3       burger   38.0
3           4        bajji   20.0
4           5  corn flakes    NaN
5           6      paratha   40.0

In [66]:
five.rename(columns={'Unnamed: 0':'num'}, inplace=True)

In [67]:
three

   snack   brand  cost  total cost
0  item1  brand1    40       42.00
1  item2  brand2    56       58.80
2  item3  brand3    78       81.90
3  item4  brand4   280      294.00
4  item5  brand5     5        5.25

In [68]:
five

   num         item   cost
0    1        salad   40.0
1    2      biryani  120.0
2    3       burger   38.0
3    4        bajji   20.0
4    5  corn flakes    NaN
5    6      paratha   40.0

In [69]:
pd.concat([three, five])

C:\Users\admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    brand   cost         item  num  snack  total cost
0  brand1   40.0          NaN  NaN  item1       42.00
1  brand2   56.0          NaN  NaN  item2       58.80
2  brand3   78.0          NaN  NaN  item3       81.90
3  brand4  280.0          NaN  NaN  item4      294.00
4  brand5    5.0          NaN  NaN  item5        5.25
0     NaN   40.0        salad  1.0    NaN         NaN
1     NaN  120.0      biryani  2.0    NaN         NaN
2     NaN   38.0       burger  3.0    NaN         NaN
3     NaN   20.0        bajji  4.0    NaN         NaN
4     NaN    NaN  corn flakes  5.0    NaN         NaN
5     NaN   40.0      paratha  6.0    NaN         NaN

In [70]:
six = pd.concat([three, five])

C:\Users\admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [71]:
six

    brand   cost         item  num  snack  total cost
0  brand1   40.0          NaN  NaN  item1       42.00
1  brand2   56.0          NaN  NaN  item2       58.80
2  brand3   78.0          NaN  NaN  item3       81.90
3  brand4  280.0          NaN  NaN  item4      294.00
4  brand5    5.0          NaN  NaN  item5        5.25
0     NaN   40.0        salad  1.0    NaN         NaN
1     NaN  120.0      biryani  2.0    NaN         NaN
2     NaN   38.0       burger  3.0    NaN         NaN
3     NaN   20.0        bajji  4.0    NaN         NaN
4     NaN    NaN  corn flakes  5.0    NaN         NaN
5     NaN   40.0      paratha  6.0    NaN         NaN

In [72]:
six.to_excel('combine.xlsx', index=False)